from testststststs.test_autorization import TestUserRegister

from testststststs.test_registration_driver import TestDriverRegister
from testststststs.test_registration_auto import TestRegisterCar
from testststststs.test_registration_insurant import TestRegisterInsurant

from Lib.assertions import Asseretions

from Lib.base_case import BaseCase
from Lib.my_requests import MyRequests
import allure
import pytest

@allure.epic("Кейс создания договора")
class TestRegisterTreaty(BaseCase):
    @allure.description("Создания договора с авторизицией и правильными данными")
    def test_log_treaty(self):
        url = "v1/agreements/calculations"
        insurant_id = TestRegisterInsurant().test_log_insurant()
        drivers_id = TestDriverRegister().test_log_driver()
        engine =TestRegisterCar().engine_power
        valid_treaty = {
            "valid_from": "2023-04-30",
            "valid_to": "2024-04-29",
            "insurance_period": 8,
            "target_of_using": 11,
            "has_car_trailer": False,
            "car_type": "B",
            "drivers_ids": [
                drivers_id
            ],
            "engine_power": engine,
            "insured_object": insurant_id,
            "owner_registration": {
                "address_query": [
                    {
                        "address_query": "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                        "address_type": "LEGAL_ADDRESS",
                        "region_kladr_id": "7800000000000",
                        "city_kladr_id": "7800000600000"
                    },
                    {
                        "address_query": "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                        "address_type": "ACTUAL_ADDRESS",
                        "region_kladr_id": "7800000000000",
                        "city_kladr_id": "7800000600000"
                    }
                ]
            }
        }
        token = TestUserRegister().test_get_user_auth()
        headers = {
            "Content-Type": "application/json; charset=utf-8",
            "Authorization": f"Token {token}"
        }
        response = MyRequests.post(url, headers=headers, json=valid_treaty)
        Asseretions.assert_code_status(response, 200)
        result = self.get_json_value(response, "id")
        return result
    @allure.description("Создание договора с произвольными данными и ожидаемым ответом")
    @pytest.mark.parametrize(
            "valid_from, valid_to, insurance_period, target_of_using, has_car_trailer, car_type, drivers_id, engine_power, insurant_id, legal_address_query, actual_address_query, legal_region_kladr_id, actual_region_kladr_id, legal_city_kladr_id, actual_city_kladr_id, expected_status",
            [
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 200),
                ("2023-04-30", "2024-04-29", 8, 11, True, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "C", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 1, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb3a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, ул Гороховая",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, ул Гороховая", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba61-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7100000003333", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000003333",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000603333", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000603333", "7800000600000", 400),
                ("", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", "", 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, "", False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, "", "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", "",
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "", "7800000000000",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "",
                 "7800000600000", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "", "7800000600000", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "", 400),
                ("2023-04-30", "2024-04-29", 8, 11, False, "B", "fabf3c22-88a6-48b2-bdad-4fcb53a32290", 211,
                 "9f085269-7280-4c2d-ba67-42ea8041ce1e",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1",
                 "г Санкт-Петербург, г Ломоносов, ул Швейцарская, д 1 к 1, кв 1", "7800000000000", "7800000000000",
                 "7800000600000", "7800000600000", 400)
            ])
    def test_log_treaty_invalid(self, valid_from, valid_to, insurance_period, target_of_using, has_car_trailer,
                                    car_type, drivers_id,
                                    engine_power, insurant_id, legal_address_query, actual_address_query,
                                    legal_region_kladr_id, actual_region_kladr_id, legal_city_kladr_id,
                                    actual_city_kladr_id, expected_status):
            url = "v1/agreements/calculations"
            valid_treaty = {
                "valid_from": valid_from,
                "valid_to": valid_to,
                "insurance_period": insurance_period,
                "target_of_using": target_of_using,
                "has_car_trailer": has_car_trailer,
                "car_type": car_type,
                "drivers_ids": [
                    drivers_id
                ],
                "engine_power": 211,
                "insured_object": insurant_id,
                "owner_registration": {
                    "address_query": [
                        {
                            "address_query": legal_address_query,
                            "address_type": "LEGAL_ADDRESS",
                            "region_kladr_id": legal_region_kladr_id,
                            "city_kladr_id": legal_city_kladr_id
                        },
                        {
                            "address_query": actual_address_query,
                            "address_type": "ACTUAL_ADDRESS",
                            "region_kladr_id": actual_region_kladr_id,
                            "city_kladr_id": actual_city_kladr_id
                        }
                    ]
                }
            }
            token = TestUserRegister().test_get_user_auth()
            headers = {
                "Content-Type": "application/json; charset=utf-8",
                "Authorization": f"Token {token}"
            }
            response = MyRequests.post(url, headers=headers, json=valid_treaty)
            Asseretions.assert_code_status(response, expected_status)
